// Алгоритм создания репозитория
// 1)создаем удаленный репозиторий на GItHub
// 2 git init-инициализируем удаленный репозиторий на ноуте
// 3) git add . -добавляем все файлы внутри папки
// 4) git commit -m "name_commmit" - делаем первый коммит, закоментировать момент "каким либо комментарием"
// 5) git branch -M main - переименовываем название с главной ветке в main
// 6) git remout add origin "ссылка проекта" -соединяем локальный репозиторий с удаленным
// 7) git push -u origin main - заливаем проект на удаленный репозиторий

// Как изменять удаленный репозиторий
// 1) git add . -добавляем все изменненные файлы
// 2) git commit -m "name_commmit" - коментируем изменения
// 3) git push origin main - Маин это название ветки